Documents/АктОРасхожденияхПослеПриемки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктОРасхожденияхПослеПриемки</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАктаОРасхождениях</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийАктОРасхожденияхПослеПриемки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитнаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСкладаСобственныйСклад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобственныеСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПоРасхождениямВАктеПослеПриемки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пересорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брак</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийМенеджера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПоДокументу</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСРасхождения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПТУ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладОтгрузкиПоставщику</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВозвратов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РазмещениеПоЯчейкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхожденияКМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасхожденияКМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Недостача</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Излишек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/АктОРасхожденияхПослеПриемки/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мПорядокСписанияПартий; // (Общ)
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мСтруктураПараметровВзаиморасчетов Экспорт;
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;
Перем мУдалятьДвижения;
Перем мУказаниеСкладовВТЧ Экспорт;


Процедура ОбработкаЗаполнения(Основание)
	
	Если Основание = Неопределено ИЛИ  ТипЗнч(Основание) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Возврат;
	Иначе
		
		//+Макрушин Е. 16.01.2026 #UT10-5634
		//акт может делать не только при транзитной поставке
		//Если Не Основание.ТранзитнаяПоставка Тогда
		//	Возврат; 
		//КонецЕсли;	
        //-Макрушин Е. 16.01.2026 #UT10-5634
		
	КонецЕсли;                                                    	
	
	ДокументОснование = Основание;                                	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	Статус = Перечисления.СтатусыАктаОРасхождениях.Отрабатывается;
	
	//+Макрушин Е. 16.01.2026 #UT10-5634
	ВидОперации = ?(Организация.ИНН = Контрагент.ИНН, Перечисления.ВидыОперацийАктОРасхожденияхПослеПриемки.Перемещение, Перечисления.ВидыОперацийАктОРасхожденияхПослеПриемки.Поступление);
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ТранзитнаяПоставка", Основание.Метаданные()) Тогда
		ТранзитнаяПоставка = Основание.ТранзитнаяПоставка;
	КонецЕсли;
	
	Если НЕ ТранзитнаяПоставка Тогда
		Статус = Перечисления.СтатусыАктаОРасхождениях.Создан;
	КонецЕсли;
	//-Макрушин Е. 16.01.2026 #UT10-5634
	
	//+Макрушин Е. 10.02.2026 #UT10-5665
	IDСкладаСобственныйСклад = Документы.АктОРасхожденияхПослеПриемки.ПолучитьIDСкладаСобственныйСклад(ДокументОснование);
	//-Макрушин Е. 10.02.2026 #UT10-5665
	
	СкопироватьТовары(ДокументОснование); 	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", Основание.Метаданные()) Тогда
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
	Иначе
		ОтражатьВУправленческомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВУправленческомУчете");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", Основание.Метаданные()) Тогда
		ОтражатьВБухгалтерскомУчете = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВНалоговомУчете     = Основание.ОтражатьВНалоговомУчете;
	Иначе
		ОтражатьВБухгалтерскомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВБухгалтерскомУчете");
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОтражатьВНалоговомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВНалоговомУчете");
		Иначе
			ОтражатьВНалоговомУчете = ОтражатьВБухгалтерскомУчете;
		КонецЕсли;
		
	КонецЕсли;   

КонецПроцедуры

Процедура ЗаполнитьРасхожденияКМ(Основание = Неопределено, ЗаполнитьКодыВРасхождениях = Истина, ЗаполнитьПризнакРасхожденияВТоварах = Истина) Экспорт
	
	//+Макрушин Е. 28.01.2026 #UT10-5635
	Если НЕ ЗначениеЗаполнено(Основание) 
		ИЛИ ((НЕ ЗаполнитьКодыВРасхождениях) И НЕ ЗаполнитьПризнакРасхожденияВТоварах)Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.АктОРасхожденияхПослеПриемки.ПолучитьТекстЗапросаПоКодамМаркировки();
	
	Запрос.УстановитьПараметр("ПТУ", Основание);
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТаблицаИзлишковИзАкта", РасхожденияКМ.Выгрузить(Новый Структура("Излишек", Истина), "КодМаркировки"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	тзКодыМаркировки = РезультатЗапроса[2].Выгрузить();
	тзРасхожденияКМ = тзКодыМаркировки.Скопировать(Новый Структура("Принято", Ложь));
	
	// Заполняем тч РасхожденияКМ
	Если ЗаполнитьКодыВРасхождениях Тогда
		
		РасхожденияКМ.Очистить();
		
		Для Каждого СтрокаКодовМаркировки Из тзРасхожденияКМ Цикл
			
			НовСтрокаРасхожденияКМ = РасхожденияКМ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаРасхожденияКМ, СтрокаКодовМаркировки);

		КонецЦикла;
		
	КонецЕсли;
	
	// Выставляем признак расхождения в тч Товары
	Если ЗаполнитьПризнакРасхожденияВТоварах Тогда
		
		тзКодыМаркировки.Свернуть("Номенклатура", "КоличествоПринято, КоличествоИзлишек, КоличествоНедостача");
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "ТребуетсяМаркировка") = Ложь Тогда
				
				СтрокаТовары.РасхожденияКМ = Ложь;
				Продолжить;
				
			КонецЕсли;
			
			КоличествоПоДокументам = СтрокаТовары.КоличествоПоДокументу;
			
			НайденнаяСтрокаПоНоменклатуреКМ = тзКодыМаркировки.Найти(СтрокаТовары.Номенклатура, "Номенклатура");	
			
			Если НайденнаяСтрокаПоНоменклатуреКМ = Неопределено Тогда
				
				СтрокаТовары.РасхожденияКМ = Ложь;
				Продолжить;
				
			КонецЕсли;
			
			Если НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято > КоличествоПоДокументам Тогда
				
				// хватило принятых
				НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято - КоличествоПоДокументам;
				
			ИначеЕсли НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято < КоличествоПоДокументам Тогда
				
				// не хватило принятых
				НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = 0;
				СтрокаТовары.РасхожденияКМ = Истина;
				
			ИначеЕсли НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = КоличествоПоДокументам И 
				(НайденнаяСтрокаПоНоменклатуреКМ.КоличествоИзлишек <> 0 ИЛИ НайденнаяСтрокаПоНоменклатуреКМ.КоличествоНедостача <> 0) Тогда
				
				// хватило принятых, но есть другие отклонения
				НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = 0;
				СтрокаТовары.РасхожденияКМ = Истина;
				
			КонецЕсли;	
				
		КонецЦикла;
	КонецЕсли;	
	//-Макрушин Е. 28.01.2026 #UT10-5635
	
КонецПроцедуры


// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьТовары(Основание = Неопределено) Экспорт
	
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Основание;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПТУ", Основание);
	Запрос.УстановитьПараметр("ЯчейкаСБраком", Константы.ЯчейкаСБракомПриТранзитныхПоставках.Получить()); 
	
	//+Макрушин Е. 15.05.2026 #UT10-5803
	Запрос.УстановитьПараметр("ДатаНачалаПроверки", НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата")) - 3600 * 24 * 7);
	//-Макрушин Е. 15.05.2026 #UT10-5803
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОбороты.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОбороты.Ячейка <> &ЯчейкаСБраком
	|					ИЛИ &ЯчейкаСБраком = ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|				ТОГДА ТоварыВЯчейкахОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОбороты.Ячейка = &ЯчейкаСБраком
	|					И &ЯчейкаСБраком <> ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|				ТОГДА ТоварыВЯчейкахОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоБрак
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	//+Макрушин Е. 15.05.2026 #UT10-5803	
//	|	РегистрНакопления.ТоварыВЯчейках.Обороты(, , Регистратор, ) КАК ТоварыВЯчейкахОбороты
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачалаПроверки, , Регистратор, ) КАК ТоварыВЯчейкахОбороты
	//-Макрушин Е. 15.05.2026 #UT10-5803
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор.ДокументОснование = &ПТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоПоДокументу,
	|	СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК СерияНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.КодСтрокиУТ11
	|ПОМЕСТИТЬ Поступило
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &ПТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.КодСтрокиУТ11
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступило.Номенклатура,
	|	Поступило.КоличествоПоДокументу,
	|	ВЫРАЗИТЬ(Поступило.Сумма / Поступило.КоличествоПоДокументу КАК ЧИСЛО(15, 2)) КАК Цена,
	|	Поступило.Сумма,
	|	Поступило.СтавкаНДС,
	|	Поступило.СуммаНДС,
	|	Поступило.СерияНоменклатуры,
	|	Поступило.КодСтрокиУТ11 КАК КлючСтроки,
	|	ЕСТЬNULL(Размещено.Количество, 0) Как Количество,
	|	ЕСТЬNULL(Размещено.КоличествоБрак, 0) Как КоличествоБрак,
	|	ЛОЖЬ КАК Брак
	|ИЗ
	|	Поступило КАК Поступило
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО Поступило.Номенклатура = Размещено.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючСтроки";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблЧасть = РезультатЗапроса.Скопировать();
	ТоварыТаблЧасти = ТаблЧасть.Скопировать();
	ТоварыТаблЧасти.Свернуть("Номенклатура");
	
	Если НЕ ТоварыТаблЧасти.Количество() = 0 Тогда
		
		Для Каждого СтрокаРезультата Из ТоварыТаблЧасти Цикл
			
			ЕстьСтрокиСНоменклатурой = ТаблЧасть.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРезультата.Номенклатура));
			
			Если НЕ ЕстьСтрокиСНоменклатурой.Количество() = 1 Тогда
				
				Разместили = ЕстьСтрокиСНоменклатурой[0].Количество;
				РазместилиБрак = ЕстьСтрокиСНоменклатурой[0].КоличествоБрак;  
				
				Для Каждого СтрСНоменклатурой Из ЕстьСтрокиСНоменклатурой Цикл
					
					Если НЕ Разместили = 0 Тогда
						
						Если СтрСНоменклатурой.КоличествоПоДокументу >= Разместили Тогда
							
							СтрСНоменклатурой.Количество = Разместили;
							Разместили = 0 ;						
							
						Иначе
							
							Разместили = Разместили-СтрСНоменклатурой.КоличествоПоДокументу;
							СтрСНоменклатурой.Количество = СтрСНоменклатурой.КоличествоПоДокументу;
							
						КонецЕсли;

					Иначе
						СтрСНоменклатурой.Количество = 0 ;
					КонецЕсли;

					Если НЕ РазместилиБрак = 0 Тогда
						
						СтрСНоменклатурой.КоличествоБрак = Мин(СтрСНоменклатурой.КоличествоПоДокументу, РазместилиБрак);
						РазместилиБрак = РазместилиБрак - СтрСНоменклатурой.КоличествоБрак; 
						
					Иначе
						СтрСНоменклатурой.КоличествоБрак = 0;
					КонецЕсли;			

				КонецЦикла;			
				
			КонеЦЕсли;
			
		КонецЦикла;
		
		//Добавление строки с браком
		Для Каждого Стр Из ТаблЧасть Цикл
			
			Если Стр.КоличествоБрак > 0 Тогда
				
				СтрокаБрак = ТаблЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаБрак, Стр);
				СтрокаБрак.Количество = Стр.КоличествоБрак;
				СтрокаБрак.КоличествоБрак = 0;
				СтрокаБрак.Брак = Истина;
				СтрокаБрак.КоличествоПоДокументу = 0;
				СтрокаБрак.КлючСтроки = 0;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Для Каждого СтрокаДобавитьВТЧ Из ТаблЧасть Цикл
			
			СтрокаТабличнойЧасти = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаДобавитьВТЧ);
			СтрокаТабличнойЧасти.Склад = Склад;
			СтрокаТабличнойЧасти.КоличествоРасхождения = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.КоличествоПоДокументу;
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, "Приобретение"); 
			
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			Контрагент, ТипЦен, ДоговорКонтрагента, Дата,ВалютаДокумента, УчитыватьНДС,СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета); 
			
			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуРасхожденияТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСРасхожденияТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			//УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			//+Макрушин Е. 15.04.2026 #UT10-5802
			Если НЕ ДокументВыгружаетсяВВебСервис(Истина) Тогда
				
				Если СтрокаТабличнойЧасти.Брак Тогда
					СтрокаТабличнойЧасти.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления;
				ИначеЕсли СтрокаТабличнойЧасти.КоличествоРасхождения < 0 Тогда
					СтрокаТабличнойЧасти.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу;
				ИначеЕсли СтрокаТабличнойЧасти.КоличествоРасхождения > 0 Тогда
					СтрокаТабличнойЧасти.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное;
				КонецЕсли;
				
			КонецЕсли;
			//-Макрушин Е. 15.04.2026 #UT10-5802
			
		КонецЦикла;
		
	КонецЕсли;
	
	//+Макрушин Е. 28.01.2026 #UT10-5635
	ЗаполнитьРасхожденияКМ(Основание);
	//-Макрушин Е. 28.01.2026 #UT10-5635
	
КонецПроцедуры // СкопироватьТовары()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	#Если Клиент Тогда
		Если Не Отказ и Статус <> Перечисления.СтатусыАктаОРасхождениях.ОтработаноВУТ11 Тогда
			
			Для Каждого Строка Из Товары Цикл
				
				Если Не ЗначениеЗаполнено(Строка.СерияНоменклатуры) Тогда
					
					Если Статус = Перечисления.СтатусыАктаОРасхождениях.Отрабатывается Тогда
						
						Если Строка.КоличествоПоДокументу <> 0 Тогда
							
							Сообщить("В строке : " + Строка.НомерСтроки + " не заполнена серия!!", СтатусСообщения.ОченьВажное);
							Отказ = Истина;
							
						КонецЕсли;
						
					ИначеЕсли Статус = Перечисления.СтатусыАктаОРасхождениях.НаКонтроле или Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано Тогда
						
						Сообщить("В строке : " + Строка.НомерСтроки + " не заполнена серия!!", СтатусСообщения.ОченьВажное);
						Отказ = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;			
			
		КонецЕсли;
		
		//+Макрушин Е. 15.04.2026 #UT10-5802
		//вынес условие в отдельную функцию
		Если ДокументВыгружаетсяВВебСервис() Тогда	
		//-Макрушин Е. 15.04.2026 #UT10-5802
			
			ПроверитьНоменклатуру(Отказ);
			
			Если НЕ Отказ Тогда
				
				//+Макрушин Е. 10.02.2026 #UT10-5665
				Если (НЕ ТранзитнаяПоставка) 
					И Статус = Перечисления.СтатусыАктаОРасхождениях.НаСогласовании 
					И ЗначениеЗаполнено(IDСкладаСобственныйСклад) Тогда
					
					РезультатЗапроса = МСКWEB.ОтправитьАктОРасхожденииВУТ10(СокрЛП(Ссылка.УникальныйИдентификатор()), ДокументОснование.ИДДокументаВСмежнойБазе,
				                          ДокументОснование.Статус, Ссылка);
				Иначе
				//-Макрушин Е. 10.02.2026 #UT10-5665
				
				    РезультатЗапроса = МСКWEB.СоздатьАктОРасхожденииВУТ11(СокрЛП(Ссылка.УникальныйИдентификатор()), ДокументОснование.ИДДокументаВСмежнойБазе,
				                          ДокументОснование.Статус, Ссылка);
										  
				//+Макрушин Е. 10.02.2026 #UT10-5665
				КонецЕсли;
				//-Макрушин Е. 10.02.2026 #UT10-5665
				
				Если РезультатЗапроса.Результат Тогда
					
					//+Макрушин Е. 02.02.2026 #UT10-5634
					Если ТранзитнаяПоставка Тогда
					//-Макрушин Е. 02.02.2026 #UT10-5634	
						
						ОбъектОснование = ДокументОснование.ПолучитьОбъект();					
						ОбъектОснование.Статус = Перечисления.СтатусыПТУ.ТребуетсяОбработка;
						
						Попытка
							ОбъектОснование.Записать(?(ДокументОснование.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
						Исключение
							
							ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка, ДокументОснование.Метаданные(), ДокументОснование.Ссылка,
							"Ошибка проведения " + СокрЛП(Ссылка) + Символы.ПС + СокрЛП(ОписаниеОшибки())); 
							
						КонецПопытки;
						
					//+Макрушин Е. 02.02.2026 #UT10-5634
					КонецЕсли;
					//-Макрушин Е. 02.02.2026 #UT10-5634
						
				Иначе
					
					ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
					"Ошибка создания Акта о расхождении CreateVarianceAct по " + СокрЛП(Ссылка) + Символы.ПС + СокрЛП(РезультатЗапроса.ТекстОшибки));
					Сообщить(РезультатЗапроса.ТекстОшибки);
					Отказ = Истина;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
		//+Макрушин Е. 28.01.2026 #UT10-5634
		Если НЕ Отказ Тогда
			
			СтатусПриемкиПТУ = МСКWEB.ЗначениеДопСвойства(ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
			
			Если Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано Тогда
				
				//+Макрушин Е. 15.04.2026 #UT10-5802
				//Если СтатусПриемкиПТУ <> Перечисления.СтатусыПриемки.Завершено Тогда
				Если ПолучитьКоличествоНеразмещенныхПозицийПТУ() = 0 И СтатусПриемкиПТУ <> Перечисления.СтатусыПриемки.Завершено Тогда
				//-Макрушин Е. 15.04.2026 #UT10-5802	
					МСКWEB.УстановитьЗначениеДопСвойства(ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.Завершено);
				КонецЕсли;
				
			Иначе
				
				Если СтатусПриемкиПТУ <> Перечисления.СтатусыПриемки.ОбратитеВнимание И СтатусПриемкиПТУ <> Перечисления.СтатусыПриемки.Завершено Тогда
					МСКWEB.УстановитьЗначениеДопСвойства(ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ОбратитеВнимание);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//-Макрушин Е. 28.01.2026 #UT10-5634
		
	#КонецЕсли

КонецПроцедуры

Функция ПроверитьНоменклатуру(Отказ)
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Номенклатура.КодМДМ) Тогда
			
			Отказ =  Истина;			
			Сообщить("В строке " + СокрЛП(СтрокаТовары.НомерСтроки) + " у номенклатуры не заполнен Код МДМ. Для его получения в УТ10 необходимо обратиться в отдел разработки ассортимента (ОРА)");
			
		КонецЕсли;		
		
	КонецЦикла;

КонецФункции 

Функция ДокументВыгружаетсяВВебСервис(НеУчитыватьСтатусАкта = Ложь) Экспорт
	
	//+Макрушин Е. 15.04.2026 #UT10-5802
	Результат = (ДокументОснование.ТранзитнаяПоставка И ДокументОснование.Статус = Перечисления.СтатусыПТУ.ВРаботе) 
			ИЛИ ((НЕ ТранзитнаяПоставка) 
					И (НеУчитыватьСтатусАкта ИЛИ Статус = Перечисления.СтатусыАктаОРасхождениях.НаСогласовании) 
					И (ЗначениеЗаполнено(IDСкладаСобственныйСклад) ИЛИ Контрагент = Константы.ОсновнойПоставщик.Получить()));
				
	Возврат Результат;
	//-Макрушин Е. 15.04.2026 #UT10-5802
	
КонецФункции

Функция ПолучитьКоличествоНеразмещенныхПозицийПТУ() экспорт
	
	//+Макрушин Е. 15.04.2026 #UT10-5802
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ Поступление
	|ИЗ
	|	Документ." + СокрЛП(ДокументОснование.Метаданные().Имя) + ".Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументОснование
	|	И ТоварыДокумента.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступление.Номенклатура,
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) КАК Количество
	|ИЗ
	|	Поступление КАК Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО Поступление.Номенклатура = Размещено.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Поступление.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) > 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	//-Макрушин Е. 15.04.2026 #UT10-5802
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Если НЕ ЗначениеЗаполнено(Статус) Тогда 
			
			Отказ = Истина;
			Сообщить("Не заполнен ""Статус"" !", СтатусСообщения.Важное);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#Если Клиент Тогда
	
Функция ПечатьАктаОРасхождениях()
	
	ТабДокумент  = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("АктОРасхождениях");
			
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект);
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Контрагент = Контрагент;
	ОбластьШапка.Параметры.Организация = Организация;
	ОбластьШапка.Параметры.Филиал = Константы.База.Получить();
	ОбластьШапка.Параметры.Склад = Склад;
	ОбластьШапка.Параметры.Распоряжение = ДокументОснование;
	ТабДокумент.Вывести(ОбластьШапка);		
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоРасхождения,
	|	АктОРасхожденияхПослеПриемкиТовары.ЕдиницаИзмерения
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &Ссылка
	|	И АктОРасхожденияхПослеПриемкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
					
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");	
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка); 
		ТабДокумент.Вывести(ОбластьСтрокаТаблицы);		
		
	КонецЦикла;
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабДокумент.Вывести(ОбластьПодвалТаблицы);
	
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьПодписи);
			 
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
	
КонецФункции
	
// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "АктОРасхождениях" Тогда
		ТабДокумент = ПечатьАктаОРасхождениях();					
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		
КонецПроцедуры // Печать
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;	
	СтруктураМакетов.Вставить("АктОРасхождениях", "Акт о расхождениях");
		
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, Услуги"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();

УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);
